loket/antri/app/Controllers/UserCrud.php

    public function list(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function index(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function singleUser($id = null){
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '5'
 LIMIT 1

    public function delete($id = null){
        $userModel = new UserModel();
        $data['user'] = $userModel->where('id', $id)->delete($id);
---
DELETE FROM `users`
WHERE `id` = '5'
AND `id` IN ('5')

    public function print($id = null)
    {
      $userModel = new UserModel();
      $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '6'
 LIMIT 1

        public function list1(){
            $userModel1 = new UserModel();
            $data1['users1'] = $userModel1->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

        public function delete1($id1 = null){
            $userModel1 = new UserModel();
            $data1['user1'] = $userModel1->where('id', $id1)->delete($id1);
---
DELETE FROM `users`
WHERE `id` = '6'
AND `id` IN ('6')